Grovety/meeting_room_leader/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_SPEED=80
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_FREERTOS_HZ=1000
CONFIG_SPIFFS_OBJ_NAME_LEN=64

CONFIG_ESP_PANEL_DRIVERS_FILE_SKIP=y
CONFIG_ESP_PANEL_DRIVERS_BUS_USE_RGB=y
CONFIG_ESP_PANEL_DRIVERS_BUS_USE_I2C=y
CONFIG_ESP_PANEL_DRIVERS_LCD_USE_ST7262=y
CONFIG_ESP_PANEL_DRIVERS_TOUCH_USE_GT911=y
CONFIG_ESP_PANEL_DRIVERS_BACKLIGHT_COMPILE_UNUSED_DRIVERS=n

CONFIG_ESP_PANEL_BOARD_FILE_SKIP=y
CONFIG_ESP_PANEL_BOARD_DEFAULT_USE_CUSTOM=y
CONFIG_ESP_PANEL_BOARD_NAME="Elecrow:CrowPanel_Advance_5_0"
CONFIG_ESP_PANEL_BOARD_WIDTH=800
CONFIG_ESP_PANEL_BOARD_HEIGHT=480

CONFIG_ESP_PANEL_BOARD_USE_LCD=y
CONFIG_ESP_PANEL_LCD_CONTROLLER_ST7262=y
CONFIG_ESP_PANEL_BOARD_LCD_BUS_TYPE_RGB=y
CONFIG_ESP_PANEL_BOARD_LCD_BUS_TYPE=2
CONFIG_ESP_PANEL_BOARD_LCD_COLOR_BITS_RGB565=y
CONFIG_ESP_PANEL_BOARD_LCD_COLOR_BITS=16
CONFIG_ESP_PANEL_BOARD_LCD_RGB_USE_CONTROL_PANEL=n
CONFIG_ESP_PANEL_BOARD_LCD_RGB_HPW=4
CONFIG_ESP_PANEL_BOARD_LCD_RGB_HBP=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_HFP=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_VPW=4
CONFIG_ESP_PANEL_BOARD_LCD_RGB_VBP=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_VFP=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_PCLK_ACTIVE_NEG=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_BOUNCE_BUF_SIZE=8000
CONFIG_ESP_PANEL_BOARD_LCD_RGB_DATA_FORMAT_16_RGB565=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_DATA_WIDTH=16
CONFIG_ESP_PANEL_BOARD_LCD_RGB_PIXEL_BITS=16
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_HSYNC=40
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_VSYNC=41
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DE=42
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_PCLK=39
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DISP=-1
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA0=21
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA1=47
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA2=48
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA3=45
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA4=38
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA5=9
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA6=10
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA7=11
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA8=12
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA9=13
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA10=14
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA11=7
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA12=17
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA13=18
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA14=3
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA15=46
CONFIG_ESP_PANEL_BOARD_LCD_RST_IO=-1

CONFIG_ESP_PANEL_BOARD_USE_TOUCH=y
CONFIG_ESP_PANEL_BOARD_TOUCH_CONTROLLER_GT911=y
CONFIG_ESP_PANEL_BOARD_TOUCH_BUS_TYPE_I2C=y
CONFIG_ESP_PANEL_BOARD_TOUCH_BUS_TYPE=3
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_HOST_ID=0
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_ADDRESS=93
CONFIG_ESP_PANEL_BOARD_TOUCH_INT_IO=-1
CONFIG_ESP_PANEL_BOARD_TOUCH_RST_IO=-1
CONFIG_ESP_PANEL_BOARD_TOUCH_BUS_SKIP_INIT_HOST=y

CONFIG_ESP_PANEL_BOARD_USE_BACKLIGHT=n

CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_CUSTOM_INCLUDE="lv_mem_psram.h"
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_CLK_HZ=18000000
CONFIG_LV_DISP_DEF_REFR_PERIOD=40
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_TXT_ENC_UTF8=y
CONFIG_LV_LABEL_LONG_TXT_HINT=y
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y
CONFIG_LV_USE_USER_DATA=y
CONFIG_LV_USE_FONT_PLACEHOLDER=y
CONFIG_LV_USE_BTN=y
CONFIG_LV_USE_BTNMATRIX=y
CONFIG_LV_USE_IMG=y
CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_MSGBOX=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_ROLLER=y
CONFIG_LV_USE_SPINNER=y
CONFIG_LV_USE_TEXTAREA=y

CONFIG_I2C_BUS_BACKWARD_CONFIG=y

CONFIG_ESP_PANEL_BOARD_EXPANDER_SKIP_INIT_HOST=y
CONFIG_ESP_PANEL_BOARD_EXPANDER_I2C_ADDRESS=24

CONFIG_ESP_PANEL_BUS_I2C_SKIP_INIT_HOST=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=4
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8
